Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The string to change the byte of.
zh_cn: 要更改其字节的字符串。

source: The string to check against.
zh_cn: 要检查的字符串。

source: The string to check.
zh_cn: 要检查的字符串。

source: The string to convert over multiple lines
zh_cn: 要在多行上转换的字符串

source: The string to convert to letters and digits.
zh_cn: 要转换为字母和数字的字符串。

source: The string to convert to letters.
zh_cn: 要转换为字母的字符串。

source: The string to convert to lowercase.
zh_cn: 要转换为小写的字符串。

source: The string to convert to uppercase.
zh_cn: 要转换为大写的字符串。

source: The string to copy and delete from.
zh_cn: 要从中复制和删除的字符串。

source: The string to copy from.
zh_cn: 要从中复制的字符串。

source: The string to create the file from.
zh_cn: 要从中创建文件的字符串。

source: The string to decode.
zh_cn: 要解码的字符串。

source: The string to draw.
zh_cn: 要绘制的字符串。

source: The string to encode.
zh_cn: 要编码的字符串。

source: The string to get the digits from.
zh_cn: 从中获取数字的字符串。

source: The string to hash.
zh_cn: 要哈希运算的字符串。

source: The string to iterate over.
zh_cn: 要遍历的字符串。

source: The string to measure the height of.
zh_cn: 要测量其高度的字符串。

source: The string to measure the number of bytes of.
zh_cn: 要测量其字节数的字符串。

source: The string to measure the number of characters of.
zh_cn: 要测量其字符数的字符串。

source: The string to measure the width of.
zh_cn: 要测量宽度的字符串。

source: The string to read
zh_cn: 要读取的字符串

source: The string to read from.
zh_cn: 要从中读取的字符串。

source: The string to read into the DS grid.
zh_cn: 要读入DS网格的字符串。

source: The string to repeat.
zh_cn: 要重复的字符串。

source: The string to return if a string is not found in the defined place (or the .ini file does not exist).
zh_cn: 如果在定义的位置找不到字符串（或 .ini 文件不存在），则返回的字符串。

source: The string to show in the pop-up message.
zh_cn: 要在弹出消息中显示的字符串。

source: The string to show in the pop-up question.
zh_cn: 要在弹出问题中显示的字符串。

source: The string to write from.
zh_cn: 要写入的字符串。

source: The string to write to the file.
zh_cn: 要写入文件的字符串。

source: The string to write to the relevant destination.
zh_cn: 要写入相关目标的字符串。

source: The string with which to find the Unicode code.
zh_cn: 用来查找Unicode代码的字符串。

source: The string you wish to send to the specified URL
zh_cn: 您希望发送到指定URL的字符串

source: The string.
zh_cn: 字符串。

source: The struct or Function reference to use.
zh_cn: 要使用的结构或函数引用。

source: The struct pointer for the channel to evaluate.
zh_cn: 要计算的通道的结构指针。

source: The struct reference to check
zh_cn: 要检查的结构引用

source: The struct reference to check.
zh_cn: 要检查的结构引用。

source: The struct reference to remove the variable from
zh_cn: 要从中删除变量的结构引用

source: The struct reference to set
zh_cn: 要设置的结构引用

source: The struct reference to set.
zh_cn: 要设置的结构引用。

source: The struct reference to use
zh_cn: 要使用的结构引用

source: The struct reference to use.
zh_cn: 要使用的结构引用。

source: The struct that you want to create a weak reference for
zh_cn: 要为其创建弱引用的结构

source: The struct to set as the static
zh_cn: 要设置为静态

source: The sub-image (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).
zh_cn: 要绘制的精灵的子图像(帧)(image_index或-1与对象中的当前动画帧相关)。

source: The sub-image of ind to change the cache size of.
zh_cn: 要更改其缓存大小的子图像索引。

source: The sub-image of the sprite to save.
zh_cn: 要保存的sprite的子图像。

source: The sub-image of the sprite to use.
zh_cn: 要使用的精灵的子图像。

source: The subimg (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).
zh_cn: 要绘制的精灵的子帧(image_index或-1与对象中动画的当前帧相关)。

source: The substring to be inserted.
zh_cn: 要插入的子字符串。

source: The substring to check the string for.
zh_cn: 要检查字符串的子字符串。

source: The substring to look for in the string.
zh_cn: 要在字符串中查找的子字符串。

source: The substring within the string to be replaced in all instances.
zh_cn: 要在所有实例中替换的字符串中的子字符串。

source: The substring within the string to be replaced.
zh_cn: 要替换的字符串中的子字符串。

source: The suggested filename to use.
zh_cn: 要使用的建议文件名。

source: The supplied map can be created using the function gpu_get_state().
zh_cn: 提供的map可以使用函数gpu_get_state()来创建。

source: The surface must be saved as a *.png format file, and the (x,y) position must be given as local coordinates to the surface, bearing in mind that the top left corner of the surface is always (0,0).
zh_cn: 表面必须保存为*.png格式文件，(x,y)位置必须作为表面的局部坐标给出，请记住表面的左上角总是(0,0)。

source: The surface must be saved as a *.png format file.
zh_cn: 表面必须保存为*.png格式文件。

source: The system will be assigned a managed layer and will be set to have a depth of 0.
zh_cn: 系统将被分配一个管理层，并将其深度设置为0。

source: The table below shows the platforms supported along with what they return:
zh_cn: 下表显示了所支持的平台以及它们返回的内容:

source: The tap count value will be reset to 0 after the time set for a double-tap detection has passed (see the function gesture_double_tap_time()).
zh_cn: 在为双击检测设置的时间过去后，点击计数值将被重置为0(参见函数gesture_double_tap_time())。

source: The target directory to extract the files to
zh_cn: 将文件提取到的目标目录

source: The target time - in microseconds - that the garbage collector should work each frame
zh_cn: 垃圾收集器每帧工作的目标时间(以微秒为单位)

source: The target x position.
zh_cn: 目标x位置。

source: The target y position.
zh_cn: 目标y位置。

source: The text (as a string) to set the clipboard to hold.
zh_cn: 设置剪贴板要保存的文本(字符串形式)。

source: The text will be center-aligned.
zh_cn: 文本将居中对齐。

source: The text will be justified.
zh_cn: 文本将被对齐。

source: The text will be left-aligned.
zh_cn: 文本将左对齐。

source: The text will be right-aligned.
zh_cn: 文本将右对齐。

source: The text will be vertically aligned to the bottom of the frame.
zh_cn: 文本将垂直对齐到框架的底部。

source: The text will be vertically aligned to the middle of the frame.
zh_cn: 文本将垂直对齐到框架的中间。

source: The text will be vertically aligned to the top of the frame.
zh_cn: 文本将垂直对齐到框架的顶部。

source: The texture "slot" to use.
zh_cn: 要使用的纹理"槽"。

source: The texture group is decompressed and ready to be used
zh_cn: 纹理组解压缩并准备好使用

source: The texture group is loaded
zh_cn: 纹理组已加载

source: The texture group is loading
zh_cn: 纹理组正在加载

source: The texture group is unloaded
zh_cn: 纹理组被卸载

source: The texture page ID (an integer) or a texture group ID (a string)
zh_cn: 纹理页面ID(一个整数)或纹理组ID(一个字符串)

source: The texture page asset pointer to use
zh_cn: 要使用的纹理页资源指针

source: The texture page entry for the sprite to be used
zh_cn: 要使用的精灵的纹理页面条目

source: The texture page entry for the sprite to be used.
zh_cn: 要使用的精灵的纹理页面条目。

source: The texture to use (or -1 for no texture).
zh_cn: 要使用的纹理(或-1表示无纹理)。

source: The texture to use with the primitive.
zh_cn: 与图元一起使用的纹理。

source: The texture to use.
zh_cn: 使用的纹理。

source: The third input value.
zh_cn: 第三个输入值。

source: The third x coordinate.
zh_cn: 第三个x坐标。

source: The third y coordinate.
zh_cn: 第三个y坐标。

source: The threshold defines at what point the button is considered as being "pressed" for games that require them to act as a digital button.
zh_cn: 这个阈值定义了在游戏中，需要将按键作为数字按键来"按下"的程度。

source: The tile data to set
zh_cn: 要设置的平铺数据

source: The tile data to use
zh_cn: 要使用的图块(tile)数据

source: The tile data to use to clear the layer
zh_cn: 用于清除图层的平铺数据

source: The tile set ID value is the tile set index as set in the IDE and the tile data is the data "blob" that contains all the information about the tile index and the transformations that have been applied.
zh_cn: 图块集ID值是在IDE中设置的图块集索引，图块数据是包含关于图块索引和已应用的变换的所有信息的数据"blob"。

source: The tile set data to set
zh_cn: 瓷砖设置要设置的数据

source: The tile set index to be used
zh_cn: 要使用的图块集索引

source: The time (in seconds) to set for double tap gesture event detection.
zh_cn: 设置双击手势事件检测的时间(以秒为单位)。

source: The time (in seconds) to set for drag gesture event detection.
zh_cn: 为拖动手势事件检测设置的时间(秒)。

source: The time (in seconds) to set the start point to.
zh_cn: 设置开始点的时间(秒)。

source: The time is measured in milliseconds, and the function requires that you input a final level of gain for the group to have reached by the end of that time.
zh_cn: 这个时间是以毫秒为单位的，函数要求你输入在该时间结束时该组所达到的最终增益水平。

source: The time is measured in milliseconds, and the function requires that you input a final level of gain for the sound to have reached by the end of that time.
zh_cn: 时间以毫秒为单位，此函数要求您输入声音在该时间结束时达到的最终增益水平。

source: The time is measured in seconds and has a default value of 0.16.
zh_cn: 该时间以秒为单位，默认值为0.16。

source: The time is measured in seconds and has a default value of 0.16s.
zh_cn: 时间以秒为单位，默认值为0.16秒

source: The time returned ignores Daylight Saving Time (and so is Universal Time) and would normally be used in conjunction with another date/time handling function.
zh_cn: 返回的时间忽略夏令时(世界时也是如此)，通常与另一个日期/时间处理函数一起使用。

source: The time returned is based on the default time zone for the system (ie: local time).
zh_cn: 返回的时间基于系统的默认时区(即:本地时间)。

source: The time value should be between 0 (the beginning) and the end duration of the animation, which you can find using the function skeleton_animation_get_duration().
zh_cn: 时间值应该在0(开始时间)和动画的结束时间之间，可以使用函数skeleton on_animation_get_duration()找到。

source: The time zone to use for the base time.
zh_cn: 用于基本时间的时区。

source: The time-frame to draw the animation at (from 0 to the end duration, in seconds).
zh_cn: 绘制动画的时间框架(从0到结束持续时间，单位为秒)。

source: The timing method to use (see the list of constants, above)
zh_cn: 要使用的计时方法(参见上面的常量列表)

source: The top cell row of the region.
zh_cn: 区域的顶部单元格行。

source: The top edge of the rectangle to check.
zh_cn: 要检查的矩形的上边缘。

source: The top edge slice
zh_cn: 切片上边边缘

source: The top of the bounding box.
zh_cn: 边界框的顶部。

source: The top position in the surface of the part to be drawn.
zh_cn: 要绘制的部分表面的顶部位置。

source: The top position of the region of cells to copy from the source grid.
zh_cn: 要从源网格复制的单元格区域的顶部位置。

source: The torque (in Newton metres) to be applied
zh_cn: 要施加的扭矩(单位为牛顿米)

source: The total number of places of the main number to be shown.
zh_cn: 要显示的主要数字的总位数。

source: The total number of vertices to copy.
zh_cn: 要复制的顶点总数。

source: The total number of vertices to use.
zh_cn: 要使用的顶点总数。

source: The track for the animation set to use.
zh_cn: 要使用的动画集的轨道。

source: The track number to get the animation set name of.
zh_cn: 要获取动画集名称的轨道数。

source: The transparency of the colour with which the screen will be cleared
zh_cn: 屏幕将被清除的颜色的透明度

source: The type constants are the same as those used by the buffer_read() and buffer_write() functions.
zh_cn: 类型常量与buffer_read()和buffer_write()函数使用的类型常量相同。

source: The type of asset to check the tags for, only used when supplying an index for the first argument.
zh_cn: 要检查标记的资源类型，仅在为第一个参数提供索引时使用。

source: The type of asset to clear the tags from, only used when supplying an index for the first argument.
zh_cn: 要从中清除标记的资源类型，仅在为第一个参数提供索引时使用。

source: The type of asset to get the tags for, only used when supplying an index for the first argument.
zh_cn: 可选!获取标记的资源类型，仅在为第一个参数提供索引时使用。

source: The type of asset to remove the tags from, only used when supplying an index for the first argument.
zh_cn: 要移除标签的资源类型，仅在为第一个参数提供索引时使用。

source: The type of asset to set the tags on, only used when supplying an index for the first argument.
zh_cn: 要在其上设置标记的资源类型，仅在为第一个参数提供索引时使用。

source: The type of audio effect to create.
zh_cn: 要创建的音频效果的类型。

source: The type of buffer to create (see the constants list above).
zh_cn: 要创建的缓冲区类型(参见上面的常量列表)。

source: The type of buffer to create (see the constants list below).
zh_cn: 要创建的缓冲区类型(参见下面的常量列表)。

source: The type of data structure to check for (see the list of constants below)
zh_cn: 要检查的数据结构类型(请参阅下面的常量列表)

source: The type of data that is to be checked (see the list of constants here).
zh_cn: 要检查的数据类型(请参阅这里的常量列表)。

source: The type of data that is to be read from the buffer (see the list of constants above).
zh_cn: 要从缓冲区中读取的数据类型(参见上面的常量列表)。

source: The type of data that is to be read from the buffer (see the list of constants here).
zh_cn: 要从缓冲区读取的数据类型(参见此处的常量列表)。

source: The type of data that is to be written to the buffer (see the list of constants above).
zh_cn: 要写入缓冲区的数据类型(请参阅上面的常量列表)。

source: The type of data that is to be written to the buffer (see the list of constants here).
zh_cn: 要写入缓冲区的数据类型(参见此处的常量列表)。

source: The type of event to perform (see the table above).
zh_cn: 要执行的事件类型(请参见上表)。

source: The type of event to perform.
zh_cn: 要执行的事件类型。

source: The type of keyframe data to create, a constant, listed above.
zh_cn: 要创建的关键帧数据类型，上面列出了一个常量。

source: The type of keyframe to create, a constant, listed above.
zh_cn: 要创建的关键帧的类型，上面列出了一个常量。

source: The type of matrix to get the values of (see the constants listed above)
zh_cn: 获取值的矩阵类型(参见上面列出的常量)

source: The type of method used to get the game speed (see the constants above).
zh_cn: 用于获取游戏速度的方法类型(参见上面的常量)。

source: The type of method used to set the game speed (see the constants above).
zh_cn: 用于设置游戏速度的方法类型(见上面的常量)。

source: The type of server to create (see the constants listed below).
zh_cn: 要创建的服务器类型(请参阅下面列出的常量)。

source: The type of socket connection to create (see the constants listed below).
zh_cn: 要创建的套接字连接的类型(请参阅下面列出的常量)。

source: The type of the result to expect
zh_cn: 期望的结果类型

source: The type of track to create, a constant, listed above.
zh_cn: 上面列出了要创建的轨道的类型，为常量。

source: The unique ID of the emitter to get the mask of
zh_cn: 要获取其掩码的发射器的唯一ID

source: The unique ID of the emitter to set the mask of
zh_cn: 要设置掩码的发射器的唯一ID

source: The unique ID of the leaderboard as shown on the developer dashboard.
zh_cn: 排行榜的唯一ID显示在开发者仪表板上。

source: The unique ID of the player to challenge.
zh_cn: 要挑战的玩家的唯一ID。

source: The unique ID of the sound to get the mask of
zh_cn: 要获取其遮罩的声音的唯一ID

source: The unique ID of the sound to set the mask of
zh_cn: 要设置遮罩的声音的唯一ID

source: The unique ID or name of the layer to check
zh_cn: 要检查的层的唯一ID或名称

source: The unique ID value of the background element to change
zh_cn: 要更改的背景元素的唯一ID值

source: The unique ID value of the background element to check
zh_cn: 要检查的背景元素的唯一ID值

source: The unique ID value of the background element to get the information from
zh_cn: 要从中获取信息的背景元素的唯一ID值

source: The unique ID value of the background to be destroyed
zh_cn: 要销毁的背景的唯一ID值

source: The unique ID value of the element to get the layer of
zh_cn: 获取层的元素的唯一ID值

source: The unique ID value of the element to get the type of
zh_cn: 要获取类型的元素的唯一ID值

source: The unique ID value of the element to move
zh_cn: 要移动的元素的唯一ID值

source: The unique ID value of the instance element to get the ID of
zh_cn: 要获取其ID的实例元素的唯一ID值

source: The unique ID value of the instance layer to target
zh_cn: 作为目标的实例图层的唯一ID值

source: The unique ID value of the instance layer to target (or the layer name as a string)
zh_cn: 目标实例图层的唯一ID值(或字符串形式的图层名称)

source: The unique ID value of the instance to check
zh_cn: 要检查的实例的唯一ID值

source: The unique ID value of the instance to check or the keyword global
zh_cn: 要检查的实例的唯一ID值或关键字global

source: The unique ID value of the instance to check.
zh_cn: 要检查的实例的唯一ID值。

source: The unique ID value of the instance to use
zh_cn: 要使用的实例的唯一ID值

source: The unique ID value of the layer to destroy (or the layer name as a string)
zh_cn: 要破坏的图层的唯一ID值(或字符串形式的图层名称)

source: The unique ID value of the layer to get the depth of (or the layer name as a string)
zh_cn: 要获取深度的层的唯一ID值(或作为字符串的层名)

source: The unique ID value of the layer to get the elements from (or the layer name as a string)
zh_cn: 获取元素的层的唯一ID值(或字符串形式的层名)

source: The unique ID value of the layer to get the horizontal speed from
zh_cn: 用于获取水平速度的层的唯一ID值

source: The unique ID value of the layer to get the name of
zh_cn: 要获取其名称的层的唯一ID值

source: The unique ID value of the layer to get the vertical speed from
zh_cn: 要从中获取垂直速度的图层的唯一ID值

source: The unique ID value of the layer to get the x position of
zh_cn: 要获取其x位置的图层的唯一ID值

source: The unique ID value of the layer to get the y position of
zh_cn: 要获取其y位置的图层的唯一ID值

source: The unique ID value of the layer to move the element to (or the layer name as a string)
zh_cn: 要移动元素的层的唯一ID值(或字符串形式的层名)

source: The unique ID value of the layer to set the depth of (or the layer name as a string)
zh_cn: 要设置深度的图层的唯一ID值(或字符串形式的图层名称)

source: The unique ID value of the layer to set the horizontal speed of
zh_cn: 要设置水平速度的图层的唯一ID值

source: The unique ID value of the layer to set the vertical speed of
zh_cn: 设置垂直速度的层的唯一ID值

source: The unique ID value of the layer to set the x position of
zh_cn: 设置x位置的层的唯一ID值

source: The unique ID value of the layer to set the y position of
zh_cn: 设置y位置的层的唯一ID值

source: The unique ID value of the layer to target
zh_cn: 目标层的唯一ID值

source: The unique ID value of the layer to target (or the layer name as a string)
zh_cn: 目标图层的唯一ID值(或字符串形式的图层名称)

source: The unique ID value of the sequence element to target
zh_cn: 目标序列元素的唯一ID值

source: The unique ID value of the sprite element to change
zh_cn: 要更改的精灵元素的唯一ID值

source: The unique ID value of the sprite element to check
zh_cn: 要检查的精灵元素的唯一ID值

source: The unique ID value of the sprite element to get the information from
zh_cn: 获取信息的精灵元素的唯一ID值

source: The unique ID value of the sprite element to set
zh_cn: 要设置的sprite元素的唯一ID值

source: The unique ID value of the sprite to be destroyed
zh_cn: 要销毁的精灵的唯一ID值

source: The unique ID value of the struct to check.
zh_cn: 要检查的结构的唯一ID值。

source: The unique ID value of the surface to draw.
zh_cn: 要绘制的表面的唯一ID值。

source: The unique ID value of the tile map element to change
zh_cn: 要更改的tilemap元素的唯一ID值

source: The unique ID value of the tile map element to check
zh_cn: 要检查的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the cell x position of
zh_cn: 的单元格x位置的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the cell y position of
zh_cn: 要获取其单元格y位置的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the frame index of
zh_cn: 要获取其帧索引的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the height of
zh_cn: 要获取其tile map的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the mask of
zh_cn: 要获取其掩码的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the tile cell height of
zh_cn: 用于获取的平铺单元格高度的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the tile cell width of
zh_cn: 要获取的平铺单元格宽度的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the tile set from
zh_cn: 要从中获取图块集的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the tile-data of
zh_cn: 获取的瓦片数据的tilemap映射元素的唯一ID值

source: The unique ID value of the tile map element to get the width of
zh_cn: 要获取宽度的tile map元素的唯一ID值

source: The unique ID value of the tile map element to get the x position of
zh_cn: 获取x位置的平铺映射元素的唯一ID值

source: The unique ID value of the tile map element to get the y position of
zh_cn: 获取的y位置的平铺映射元素的唯一ID值

source: The unique ID value of the tile map element to set the height of
zh_cn: 要设置高度的tile map元素的唯一ID值

source: The unique ID value of the tile map element to set the mask of
zh_cn: 要设置掩码的切片地图元素的唯一ID值

source: The unique ID value of the tile map element to set the width of
zh_cn: 要设置宽度的切片地图元素的唯一ID值

source: The unique ID value of the tile map to be destroyed
zh_cn: 要销毁的tile map的唯一ID值

source: The unique ID value of the tilemap element to get the cell y position of
zh_cn: 要获取其单元格y位置的tilemap元素的唯一ID值

source: The unique camera ID value returned when you created the camera
zh_cn: 创建相机时返回的唯一相机ID值

source: The unique camera ID value returned when you created the camera.
zh_cn: 创建相机时返回的唯一相机ID值。

source: The unique challenge ID (as found on the provider dashboard).
zh_cn: 唯一的挑战ID(在提供程序指示板上可以找到)。

source: The unique instance ID or the object index of the instance to check for
zh_cn: 要检查的实例的唯一实例ID或对象索引

source: The unique instance ID value of the instance to move over to the target layer
zh_cn: 要移动到目标层的实例的唯一实例ID值

source: The unique matrix ID returned when you created the matrix.
zh_cn: 创建矩阵时返回的唯一矩阵ID。

source: The unique name of the sprite element on the layer as defined in the Room Editor
zh_cn: 在房间编辑器中定义的层上精灵元素的唯一名称

source: The unique reference or ID value of the struct or instance to use (or undefined for self)
zh_cn: 要使用的结构或实例的唯一引用或ID值(或对self未定义)

source: The units that the period is measured in
zh_cn: 衡量周期的单位

source: The upper angle limit for the joint in degrees.
zh_cn: 关节的角度上限，以度为单位。

source: The upper permitted limit for the joint angle
zh_cn: 关节角的允许上限

source: The upper range from which the random number will be selected.
zh_cn: 将从中选择随机数的上限。

source: The url or IP to connect to (a string).
zh_cn: 要连接的url或IP(字符串)。

source: The use that the data will get(see the usage constants listed below).
zh_cn: 数据将获得的用途(参见下面列出的使用常量)。

source: The user defined category to draw (use 0 to draw all categories).
zh_cn: 要绘制的用户定义的类别(使用0绘制所有类别)。

source: The user defined category to which the group belongs.
zh_cn: 组所属的用户定义的类别。

source: The user defined category to which the particle belongs.
zh_cn: 粒子所属的用户定义的类别。

source: The user needs to be signed in to GXC.
zh_cn: 用户需要登录到GXC。

source: The value (an integer) to set the alarm to.
zh_cn: 告警设置的数值(整数形式)。

source: The value for this constant is typically between 0 and 1, but can be larger, and at 1, the damping is critical meaning that all oscillations should vanish.
zh_cn: 该常量的值通常在0和1之间，但可以更大，在1时，阻尼是关键的，这意味着所有振荡都应该消失。

source: The value is normalised from 0 - 1, so if you set it to, for example, 0.5, the instance will be moved to exactly the middle of the path.
zh_cn: 该值是从0到1的标准化值，因此如果将其设置为0.5，实例将被移动到路径的正中间。

source: The value must be an integer value, and you can set it to -1 to stop the alarm (non integer values will be rounded to the nearest integer).
zh_cn: 该值必须为整数值，可以设置为-1以停止告警(非整数值将四舍五入到最接近的整数)。

source: The value of the parameter (a real number).
zh_cn: 参数的值(实数)。

source: The value returned can then be used, for example, to calculate how many frames may be drawn for different image_speed.
zh_cn: 然后，返回的值可用于例如计算对于不同的image_speed可以绘制多少帧。

source: The value returned is in microseconds (where 1,000,000 microseconds equals one second) and the default target frame time is 100 microseconds.
zh_cn: 返回的值以微秒为单位(其中1,000,000微秒等于1秒)，默认目标帧时间为100微秒。

source: The value returned will be one of the following constants ("s" denotes a value taken from the source while a "d" denotes a value from the destination) with only the "A" component being used when drawing:
zh_cn: 返回的值将是下列常量之一("s"表示从源获取的值，而"d"表示从目标获取的值)，绘制时仅使用"A"部分:

source: The value returned will be one of the following constants ("s" denotes a value taken from the source while a "d" denotes a value from the destination):
zh_cn: 返回的值将是下列常量之一("s"表示从源获取的值，"d"表示从目标获取的值):

source: The value returned will be one of the following constants (the default value is cmpfunc_lessequal):
zh_cn: 返回的值将是以下常量之一(默认值是cmpfunc_lessequal):

source: The value returned will be one of the following constants:
zh_cn: 返回值将是下列常量之一:

source: The value returned will be the factor by which the actual path_speed is being set.
zh_cn: 返回的值将是设置实际path_speed的乘数。

source: The value specified when the joint was created for the maximum motor force
zh_cn: 为最大马达力创建关节时指定的值

source: The value specified when the joint was created for the maximum motor torque
zh_cn: 为最大马达扭矩创建关节时指定的值

source: The value to add to the cell.
zh_cn: 要添加到单元格中的值。

source: The value to add to the cells within the disk.
zh_cn: 要添加到圆盘内单元格的值。

source: The value to add to the list.
zh_cn: 要添加到列表中的值。

source: The value to add to the map.
zh_cn: 要添加到map的值。

source: The value to add to the priority queue.
zh_cn: 要添加到优先队列的值。

source: The value to add to the queue.
zh_cn: 要添加到队列中的值。

source: The value to add to the region cells.
zh_cn: 要添加到区域单元格中的值。

source: The value to be added must be of the same type as that held within the grid cells, ie: you cannot add a string to a real or vice-versa, and for strings this corresponds to concatenation.
zh_cn: 要添加的值必须与网格单元格中的值具有相同的类型，即:您不能将字符串添加到实数中，反之亦然，对于字符串，这对应于连接。
